In [1]:
# Dependencies and Setup
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import gmaps

from api_key_heesu import g_key

In [2]:
# Import Data from dataset
df_land_temp = pd.read_csv("data_sets/GlobalLandTemperaturesByCountry.csv")

In [3]:
df_land_temp

,dt,AverageTemperature,AverageTemperatureUncertainty,Country
0,1743-11-01,4.384,2.294,Åland
1,1743-12-01,NaN,NaN,Åland
2,1744-01-01,NaN,NaN,Åland
3,1744-02-01,NaN,NaN,Åland
4,1744-03-01,NaN,NaN,Åland
...,...,...,...,...
577457,2013-05-01,19.059,1.022,Zimbabwe
577458,2013-06-01,17.613,0.473,Zimbabwe
577459,2013-07-01,17.000,0.453,Zimbabwe
577460,2013-08-01,19.759,0.717,Zimbabwe
577461,2013-09-01,NaN,NaN,Zimbabwe

In [4]:
splited_land_ser = df_land_temp['dt'].str.split('-').str[0]
splited_land_ser

0         1743
1         1743
2         1744
3         1744
4         1744
          ...
577457    2013
577458    2013
577459    2013
577460    2013
577461    2013
Name: dt, Length: 577462, dtype: object

In [5]:
df_land_temp["year"] = splited_land_ser.astype("int64")

In [6]:
df_land_temp

,dt,AverageTemperature,AverageTemperatureUncertainty,Country,year
0,1743-11-01,4.384,2.294,Åland,1743
1,1743-12-01,NaN,NaN,Åland,1743
2,1744-01-01,NaN,NaN,Åland,1744
3,1744-02-01,NaN,NaN,Åland,1744
4,1744-03-01,NaN,NaN,Åland,1744
...,...,...,...,...,...
577457,2013-05-01,19.059,1.022,Zimbabwe,2013
577458,2013-06-01,17.613,0.473,Zimbabwe,2013
577459,2013-07-01,17.000,0.453,Zimbabwe,2013
577460,2013-08-01,19.759,0.717,Zimbabwe,2013
577461,2013-09-01,NaN,NaN,Zimbabwe,2013

In [7]:
df_land_temp_1963 = df_land_temp.loc[(df_land_temp["year"] > 1962) & (df_land_temp["year"] < 2016),:].copy()
df_land_temp_1963

,dt,AverageTemperature,AverageTemperatureUncertainty,Country,year
2630,1963-01-01,-6.288,0.981,Åland,1963
2631,1963-02-01,-8.085,0.587,Åland,1963
2632,1963-03-01,-5.510,0.558,Åland,1963
2633,1963-04-01,1.452,0.743,Åland,1963
2634,1963-05-01,9.560,0.433,Åland,1963
...,...,...,...,...,...
577457,2013-05-01,19.059,1.022,Zimbabwe,2013
577458,2013-06-01,17.613,0.473,Zimbabwe,2013
577459,2013-07-01,17.000,0.453,Zimbabwe,2013
577460,2013-08-01,19.759,0.717,Zimbabwe,2013
577461,2013-09-01,NaN,NaN,Zimbabwe,2013

In [8]:
df_land_temp_1963.dropna(how = "any", inplace = True)

In [9]:
g_df = pd.read_excel("data_sets/heesu_country_lat_long.xlsx")
g_df.drop("country", axis=1, inplace = True)
g_df.rename(columns = {"name":"Country"},inplace = True)

In [10]:
g_df

      latitude  longitude               Country
0    42.546245   1.601554               Andorra
1    23.424076  53.847818  United Arab Emirates
2    33.939110  67.709953           Afghanistan
3    17.060816 -61.796428   Antigua and Barbuda
4    18.220554 -63.068615              Anguilla
..         ...        ...                   ...
240  15.552727  48.516388                 Yemen
241 -12.827500  45.166244               Mayotte
242 -30.559482  22.937506          South Africa
243 -13.133897  27.849332                Zambia
244 -19.015438  29.154857              Zimbabwe

[245 rows x 3 columns]

In [11]:
pd.to_numeric(df_land_temp_1963["AverageTemperature"])

2630      -6.288
2631      -8.085
2632      -5.510
2633       1.452
2634       9.560
           ...
577456    21.142
577457    19.059
577458    17.613
577459    17.000
577460    19.759
Name: AverageTemperature, Length: 147157, dtype: float64

In [12]:
country_list_h = list(df_land_temp_1963["Country"].unique())
country_list_h

['Åland',
 'Afghanistan',
 'Africa',
 'Albania',
 'Algeria',
 'American Samoa',
 'Andorra',
 'Angola',
 'Anguilla',
 'Antigua And Barbuda',
 'Argentina',
 'Armenia',
 'Aruba',
 'Asia',
 'Australia',
 'Austria',
 'Azerbaijan',
 'Bahamas',
 'Bahrain',
 'Baker Island',
 'Bangladesh',
 'Barbados',
 'Belarus',
 'Belgium',
 'Belize',
 'Benin',
 'Bhutan',
 'Bolivia',
 'Bonaire, Saint Eustatius And Saba',
 'Bosnia And Herzegovina',
 'Botswana',
 'Brazil',
 'British Virgin Islands',
 'Bulgaria',
 'Burkina Faso',
 'Burma',
 'Burundi',
 "Côte D'Ivoire",
 'Cambodia',
 'Cameroon',
 'Canada',
 'Cape Verde',
 'Cayman Islands',
 'Central African Republic',
 'Chad',
 'Chile',
 'China',
 'Christmas Island',
 'Colombia',
 'Comoros',
 'Congo (Democratic Republic Of The)',
 'Congo',
 'Costa Rica',
 'Croatia',
 'Cuba',
 'Curaçao',
 'Cyprus',
 'Czech Republic',
 'Denmark (Europe)',
 'Denmark',
 'Djibouti',
 'Dominica',
 'Dominican Republic',
 'Ecuador',
 'Egypt',
 'El Salvador',
 'Equatorial Guinea',
 'Eritrea',
 'Estonia',
 'Ethiopia',
 'Europe',
 'Falkland Islands (Islas Malvinas)',
 'Faroe Islands',
 'Federated States Of Micronesia',
 'Fiji',
 'Finland',
 'France (Europe)',
 'France',
 'French Guiana',
 'French Polynesia',
 'French Southern And Antarctic Lands',
 'Gabon',
 'Gambia',
 'Gaza Strip',
 'Georgia',
 'Germany',
 'Ghana',
 'Greece',
 'Greenland',
 'Grenada',
 'Guadeloupe',
 'Guam',
 'Guatemala',
 'Guernsey',
 'Guinea Bissau',
 'Guinea',
 'Guyana',
 'Haiti',
 'Heard Island And Mcdonald Islands',
 'Honduras',
 'Hong Kong',
 'Hungary',
 'Iceland',
 'India',
 'Indonesia',
 'Iran',
 'Iraq',
 'Ireland',
 'Isle Of Man',
 'Israel',
 'Italy',
 'Jamaica',
 'Japan',
 'Jersey',
 'Jordan',
 'Kazakhstan',
 'Kenya',
 'Kingman Reef',
 'Kiribati',
 'Kuwait',
 'Kyrgyzstan',
 'Laos',
 'Latvia',
 'Lebanon',
 'Lesotho',
 'Liberia',
 'Libya',
 'Liechtenstein',
 'Lithuania',
 'Luxembourg',
 'Macau',
 'Macedonia',
 'Madagascar',
 'Malawi',
 'Malaysia',
 'Mali',
 'Malta',
 'Martinique',
 'Mauritania',
 'Mauritius',
 'Mayotte',
 'Mexico',
 'Moldova',
 'Monaco',
 'Mongolia',
 'Montenegro',
 'Montserrat',
 'Morocco',
 'Mozambique',
 'Namibia',
 'Nepal',
 'Netherlands (Europe)',
 'Netherlands',
 'New Caledonia',
 'New Zealand',
 'Nicaragua',
 'Niger',
 'Nigeria',
 'Niue',
 'North America',
 'North Korea',
 'Northern Mariana Islands',
 'Norway',
 'Oceania',
 'Oman',
 'Pakistan',
 'Palau',
 'Palestina',
 'Palmyra Atoll',
 'Panama',
 'Papua New Guinea',
 'Paraguay',
 'Peru',
 'Philippines',
 'Poland',
 'Portugal',
 'Puerto Rico',
 'Qatar',
 'Reunion',
 'Romania',
 'Russia',
 'Rwanda',
 'Saint Barthélemy',
 'Saint Kitts And Nevis',
 'Saint Lucia',
 'Saint Martin',
 'Saint Pierre And Miquelon',
 'Saint Vincent And The Grenadines',
 'Samoa',
 'San Marino',
 'Sao Tome And Principe',
 'Saudi Arabia',
 'Senegal',
 'Serbia',
 'Seychelles',
 'Sierra Leone',
 'Singapore',
 'Sint Maarten',
 'Slovakia',
 'Slovenia',
 'Solomon Islands',
 'Somalia',
 'South Africa',
 'South America',
 'South Georgia And The South Sandwich Isla',
 'South Korea',
 'Spain',
 'Sri Lanka',
 'Sudan',
 'Suriname',
 'Svalbard And Jan Mayen',
 'Swaziland',
 'Sweden',
 'Switzerland',
 'Syria',
 'Taiwan',
 'Tajikistan',
 'Tanzania',
 'Thailand',
 'Timor Leste',
 'Togo',
 'Tonga',
 'Trinidad And Tobago',
 'Tunisia',
 'Turkey',
 'Turkmenistan',
 'Turks And Caicas Islands',
 'Uganda',
 'Ukraine',
 'United Arab Emirates',
 'United Kingdom (Europe)',
 'United Kingdom',
 'United States',
 'Uruguay',
 'Uzbekistan',
 'Venezuela',
 'Vietnam',
 'Virgin Islands',
 'Western Sahara',
 'Yemen',
 'Zambia',
 'Zimbabwe']

In [13]:
max_temp_1963 = []
max_temp_2013 = []

for country in country_list_h:
    x = df_land_temp_1963.loc[df_land_temp_1963["Country"] == country, ["AverageTemperature","year"]]
    
    y = x.loc[x["year"] == 1963,:]
    max_temp_1963.append(y["AverageTemperature"].max())
    
    z = x.loc[x["year"] == 2013,:]
    max_temp_2013.append(z["AverageTemperature"].max())

In [14]:
max_temps_df = pd.DataFrame({
    "Country": country_list_h, "max_temp_1963": max_temp_1963, "max_temp_2013":max_temp_2013
    
})

max_temps_df

            Country  max_temp_1963  max_temp_2013
0             Åland         16.193         16.447
1       Afghanistan         27.246         28.205
2            Africa         26.166         26.671
3           Albania         23.190         24.793
4           Algeria         34.225         34.707
..              ...            ...            ...
237  Virgin Islands         28.193         29.147
238  Western Sahara         28.577         28.564
239           Yemen         31.195         32.325
240          Zambia         24.716         23.636
241        Zimbabwe         24.691         24.075

[242 rows x 3 columns]

In [15]:
merge_temp_lat_lng = pd.merge(g_df,max_temps_df, on = "Country", how = "outer" ).copy()

In [16]:
#google maps limitation where temperatures cannot be negative values. removing countries with negative temp values
merge_temp_lat_lng.dropna(how = "any", inplace = True)
merge_temp_lat_lng = merge_temp_lat_lng.loc[(merge_temp_lat_lng["max_temp_1963"] >= 0),:]

In [17]:
diff_max = merge_temp_lat_lng["max_temp_2013"] - merge_temp_lat_lng["max_temp_1963"]

In [18]:
merge_temp_lat_lng["2013_1963_MaxTempDiff"] = diff_max

In [29]:
merge_temp_lat_lng = merge_temp_lat_lng.loc[(merge_temp_lat_lng["2013_1963_MaxTempDiff"] >= 0),:]

In [30]:
print(merge_temp_lat_lng["max_temp_2013"].max())
print(merge_temp_lat_lng["max_temp_1963"].min())
print(merge_temp_lat_lng["2013_1963_MaxTempDiff"].max())
print(merge_temp_lat_lng["2013_1963_MaxTempDiff"].min())

38.234
7.5059999999999985
3.224
0.0009999999999941167

7.5059999999999985

In [38]:
gmaps.configure(api_key=g_key)

locations = merge_temp_lat_lng[["latitude","longitude"]]
weights = merge_temp_lat_lng["max_temp_1963"]

fig = gmaps.figure()

heat_layer = gmaps.heatmap_layer(locations, weights=weights, dissipating = False, max_intensity = 40, point_radius = 3)
fig.add_layer(heat_layer)



fig

Figure(layout=FigureLayout(height='420px'))

In [39]:
locations = merge_temp_lat_lng[["latitude","longitude"]]
weights = merge_temp_lat_lng["max_temp_2013"]

fig = gmaps.figure()

heat_layer = gmaps.heatmap_layer(locations, weights=weights, dissipating = False, max_intensity = 40, point_radius = 3)
fig.add_layer(heat_layer)



fig

Figure(layout=FigureLayout(height='420px'))

In [35]:
locations = merge_temp_lat_lng[["latitude","longitude"]]
weights = merge_temp_lat_lng["2013_1963_MaxTempDiff"]

fig = gmaps.figure()

heat_layer = gmaps.heatmap_layer(locations, weights=weights, dissipating = False, max_intensity = 3.22, point_radius = 3)
fig.add_layer(heat_layer)



fig

Figure(layout=FigureLayout(height='420px'))